# OBJExportOptions Constructor (ExportResolution) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OBJExportOptions Constructor (ExportResolution)
OBJExportOptions Class See Also
---
Constructs a new instance of OBJExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public OBJExportOptions(
	ExportResolution resolutionType
)
```

Visual Basic
---
```text
Public Sub New ( _
	resolutionType As ExportResolution _
)
```

Visual C++
---
```text
public:
OBJExportOptions(
	ExportResolution resolutionType
)
```

# ### Parameters
resolutionType
    Type: Autodesk.Revit.DB..::..ExportResolution The type of export resolution.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
OBJExportOptions Class
OBJExportOptions Overload
Autodesk.Revit.DB Namespace